Repository: RAMD-hub/CairoMetroApp
Catalog: flutter-app/lib/l10n/app_*.arb
Languages: ar

source: welcome
ar: أزيك

# welcomeMessage
source: Where are you going Today?
ar: رايح فين انهاردة؟

source: Stations
ar: المحطات

source: View All
ar: عرض الكل

# lessStation
source: Less Stations
ar: اقل محطات

source: Less Transfer
ar: اقل تحويلات

source: Missing Input
ar: نسيت تدخل محطة

# missingInputMessage
source: Please enter both the start and end stations.
ar: دخل محطة البداية والوصول

source: Invalid Station
ar: المحطة مش موجودة

# invalidStationMessage
source: One or both stations do not exist. Please check the station names.
ar: محطة او الاتنين من اللي دخلتهم مش موجودين, معلش اتاكد تاني من اسم المحطات الموجودة

source: Same Station
ar: نفس المحطة

# sameStationMessage
source: Start and End stations cannot be the same.
ar: مينفعش تكون محطة البداية والوصول نفس المحطة

source: Start
ar: أبدا

source: Address
ar: العنوان

# addressMessage
source: Please enter your destination (optional)
ar: تقدر تحط العنوان اللي عايز توصله(اختياري)

source: Search
ar: أبحث

# startStation
source: Please Select start Station
ar: اختار محطة البداية

# arriveStation
source: Please Select arrival Station
ar: اختار محطة الوصول

source: Select Language
ar: أختر اللغة

source: Next
ar: التالي

source: Back
ar: السابق

source: Start Trip
ar: يلا بينا

source: All Paths
ar: كل الطرق

source: Trip Progress
ar: تقدم الرحلة

# stationNumber
source: Stations no {number}
ar: عدد المحطات {number}

# time
source: Time {hr} hrs {min} min
ar: الوقت {hr} ساعة , {min} دقيقة

# timeMINArb
source: time {mins}mins
ar: الوقت {mins}دقائق

# timeMIN
source: time {mins}mins
ar: الوقت {mins}دقيقة

# price
source: Price {price}
ar: السعر {price}

source: Cancel
ar: الغاء

source: SHORT PATH
ar: اقصر طريق

# shortPathMessage
source: This route is the shortest path
ar: ده اقصر طريق تقدر تاخده

# exchange
source: {station} => Exchanged Station
ar: {station}=> محطة تبادل

source: Error
ar: خد بالك

# errorMessage
source: The address is Empty
ar: مكان العنوان فاضي

# notificationServiceTitle
source: Cairo Metro
ar: انتبه

# notificationServiceText
source: Tracking your location for metro stations
ar: يتم تتبع الموقع عشان الرحلة

# notificationStartTitle
source: Start Station
ar: محطة البداية

# notificationStartMessage
source: Starting trip soon at {station}. Have a nice trip !
ar: هتبدأ الرحلة قريب من {station}. رحلة سعيدة !

# notificationEndTitle
source: Arrival Station
ar: محطة الوصول

# notificationEndMessage
source: Reaching destination soon: {station}
ar: اخيرا ! هتوصل قريب لمحطة {station}

# notificationIntersectionTitle
source: Intersection Station
ar: محطة تبادل

# notificationIntersectionMessage
source: Reaching an intersection soon: {station}
ar: خد بالك هتوصل إلى محطة تبادل {station}

# locationServicesDisabled
source: Location services are disabled.
ar: خدمات الموقع معطلة

# locationPermissionsDenied
source: Location permissions are denied
ar: تم رفض أذونات الموقع

# locationPermissionsPermanentlyDenied
source: Location permissions are permanently denied, we cannot request permissions.
ar: تم رفض أذونات الموقع بشكل دائم، لا يمكننا طلب الأذونات

# invalidAddress
source: Invalid or non-existent address
ar: عنوان غير صالح أو غير موجود

# addressConversionError
source: Failed to convert address to coordinates: {error}
ar: فشل في تحويل العنوان إلى إحداثيات: {error}

# startStationLabel
source: {station} => pervious station
ar: {station} => المحطه اللي فاتت

# currentStationLabel
source: {station} => You are here now
ar: {station} => انت هنا دلوقتي

# arrivalStationLabel
source: {station} => next station
ar: {station} => المحطة اللي جاية

source: language
ar: اللغة

# languageMessage
source: cant change language while trip
ar: مينفعش تتغير اللغة وفيه رحلة شغالة

# locationIconDescription
source: Click to get your current location and find the nearest station in map.
ar: اضغط للحصول على موقعك الحالي واكتشاف أقرب محطة علي الخريطة.

# languageIconDescription
source: Click to change the app language.
ar: اضغط لتغيير لغة التطبيق.

# nearestStationDescription
source: Click to automatically pick the nearest station from the dropdown.
ar: اضغط لاختيار أقرب محطة تلقائياً من القائمة.

# searchButtonDescription
source: Click to search for the nearest station to your destination.
ar: اضغط للبحث عن أقرب محطة إلى عنوانك التي تريد الوصول اليه.

# liveTrackingDescription
source: Press to start tracking your trip. Notifications will alert you at interchange and arrival stations.
ar: اضغط لبدء تتبع رحلتك. ستصلك إشعارات عند محطات التبديل والوصول.

# cancelTrip
source: Press to cancel the current trip and stop notifications.
ar: اضغط لإلغاء الرحلة الحالية وإيقاف الإشعارات.

# onboardingPage1Title
source: Welcome to CairoMetro App 🚆
ar: مرحبًا بك في تطبيق مترو القاهرة🚆

# onboardingPage1Subtitle
source: The easiest way to navigate Cairo Metro.
ar: أسهل طريقة للتنقل داخل مترو القاهرة.

# onboardingPage2Title
source: Choose the Shortest Route 🧭
ar: اختر أقصر طريق 🧭

# onboardingPage2Subtitle
source: We calculate the shortest route based on the least stations or interchanges — and show you all possible options.
ar: نحسب لك أقصر مسار بناءً على أقل عدد محطات أو أقل تبادلات، ونوريك كمان كل الطرق الممكنة.

# onboardingPage3Title
source: Smart Trip Tracking 📍
ar: متابعين رحلتك لحظة بلحظة 📍

# onboardingPage3Subtitle
source: We track your location during the trip in the background and send you alerts at interchange and arrival stations.
ar: نتبع موقعك أثناء رحلتك في الخلفية، ونرسل لك إشعارات عند محطات التبديل والوصول.

# onboardingPage4Title
source: Ready to Start? 🚀
ar: جاهز تبدأ رحلتك؟ 🚀

# onboardingPage4Subtitle
source: Tap to begin your journey with Cairo Metro.
ar: اضغط وابدأ تجربتك مع مترو القاهرة.

# onboardingSkip
source: Skip
ar: تخطي

# onboardingStart
source: Start Now
ar: ابدأ الآن
